package org.demo;


import java.util.Random;

public class Test {

    public static void main(String[] args) {
        /**
         * 1) Создать переменную и занести в нее значение - количество миллисекунд в сутках;
         * 2) Создать переменную a1 short, a2 int, a3 short;
         *      - a2 занести любое тестовое значениеж
         *      - a3 занести значение 50000
         *      - занести в a1 сумму, разницу, результаты умножения и деления a2, a3;
         *  3) Создать переменную a1 int , a2 long
         *      - занести в a2 3000000000
         *      - занести в a1 значение FF в 16 ричной системе счисления
         *      - сложить , вычесть, перемножить , поделить a1 и a2
         *
         */

        /**
         * создать переменную типа int a1, int a2
         * заполнить их случайными значениями от 100 до 200
         * выполнить операции сравнения:
         *  а1 = а1
         *  a1 > a2
         *  a1 четное
         *  a2 четное
         *  a1 и а2 четное
         *  a1 или a2 четное
         *  результаты логических операция сохранить в переменные с типом booleab
         */

        /**
         * Создать массив чисел типа int от 1 до 100
         * заполнить их случайными числами от 100 до 10 000
         * определить количество четных чисел в массиве
         * посчитать сумму чисел в массиве
         *
         * создать массив символов: H,e,l,l,o, ,w,o,r,l,d
         * вывести на консоль массив
         * вывести массив в обратном порядке
         *
         */

        /**
         * Home Work;
         *
         * 1)   - Создать массив елементов от 0 до 100;
         *      - заполнить его случайными числами от 100 до 10 000
         *      -  определить максимальное и минимальное число в массиве
         *
         * 2)   - Создать переменную int var,
         *      - Заполнить любым целым числом
         *      - С помощью циклов for, while, do while реализовать вычисление факториала от числа:
         *          пример факториала от int var = 6; 6 * 5 * 4 * 3 * 2 * 1;
         *
         * 3) создать переменные int height; int width;
         *      - заполнить случвйными числами от 10 до 100
         *      - вывести на консоль прямоугольник из символов '#' размером height X width
         *      Например height = 10, width = 20;
         *      ####################
         *      ####################
         *      ####################
         *      ####################
         *      ####################
         *      ####################
         *      ####################
         *      ####################
         *      ####################
         *      ####################
         *
         *  4) Аналогично заданию 3 вывести "полый" прямоугольник
         *      Например height = 10, width = 20;
         *      ####################
         *      #                  #
         *      #                  #
         *      #                  #
         *      #                  #
         *      #                  #
         *      #                  #
         *      #                  #
         *      #                  #
         *      ####################
         */

        System.out.println("Test class");
    }

}
